*** mecab
:PROPERTIES:
:CREATED:  2025-01-03 23:18:14
:END:

This module relies primarily on mecab to parse japanese. In particular it uses mecab unidict.

I think the easiest way is to download it from here: https://github.com/CrescentKohana/MecabUnidic/releases/tag/v1.2.1

Download the corresponding binary and install. You should have a file support/matrix.bin that is 459Mbytes.

Then create a script to run it from the command line using the corresponding
files. I call this script m-mecab.sh

Pay attention to the directory where the support files are installed. Make sure that the file mecab is executable.

#+begin_src bash
#!/usr/bin/env bash
MDIR="/Users/dmg/bin/osx/MecabUnidic/support"
export LD_LIBRARY_PATH="$MDIR":
export DYLD_LIBRARY_PATH="$MDIR":
#"$MDIR/mecab" -d $MDIR -h
if [ "$1" == "" ] ; then
    "$MDIR/mecab" -d $MDIR -r "$MDIR/mecabrc"
else
    "$MDIR/mecab" -d $MDIR -r "$MDIR/mecabrc" $*
fi
#unidic22
#+end_src


Make sure you get the following output (replace
/Users/dmg/bin/osx/m-mecab.sh with the path to mecab in your installation). Note the number of columns in the output:

#+begin_src bash :results verbatim :exports both
echo "猫が大好きです。" | /Users/dmg/bin/osx/m-mecab.sh 
#+end_src

#+RESULTS:
#+begin_example
猫	名詞,普通名詞,一般,*,*,*,ネコ,猫,猫,ネコ,猫,ネコ,和,*,*,*,*,*,*,体,ネコ,ネコ,ネコ,ネコ,1,C4,*,7918141678166528,28806
が	助詞,格助詞,*,*,*,*,ガ,が,が,ガ,が,ガ,和,*,*,*,*,*,*,格助,ガ,ガ,ガ,ガ,*,"動詞%F2@0,名詞%F1",*,2168520431510016,7889
大好き	形状詞,一般,*,*,*,*,ダイスキ,大好き,大好き,ダイスキ,大好き,ダイスキ,混,*,*,*,*,*,*,相,ダイスキ,ダイスキ,ダイスキ,ダイスキ,1,C1,*,6326873407758848,23017
です	助動詞,*,*,*,助動詞-デス,終止形-一般,デス,です,です,デス,です,デス,和,*,*,*,*,*,*,助動,デス,デス,デス,デス,*,"形容詞%F2@-1,動詞%F2@0,名詞%F2@1",*,7051468750332587,25653
。	補助記号,句点,*,*,*,*,*,。,。,*,。,*,記号,*,*,*,*,*,*,補助,*,*,*,*,*,*,*,6880571302400,25
EOS
#+end_example

*** myougiden (Japanese dictionary)
:PROPERTIES:
:CREATED:  2025-01-03 23:18:14
:END:

- Install [[https://github.com/melissaboiko/myougiden][myougiden]]. this is done using pip. See its website. After running pip you need to download/install the dictionary.

- make sure you can run it from the command line:

#+begin_src bash :results verbatim
myougiden お願い
#+end_src

#+RESULTS:
#+begin_example
おねがい	お願い；御願い	[n,vs,vt;pol] request|favour (to ask)|wish	[int] please (P)
#+end_example

* mecab parsing
:PROPERTIES:
:CREATED:  2025-01-03 23:18:14
:END:

From each sentence we obtain the root, the type of word, and the surface (kanji/hiragana version seen). For example:

#+begin_example
美味しい寿司を食べた。おいしくないすしはたべられない
#+end_example

#+name: mecab
#+begin_src bash :results verbatim :exports both
echo "美味しい寿司を食べた。おいしくないすしはたべられない" | m-mecab.sh
#+end_src

#+RESULTS:
#+begin_example
美味しい	形容詞,一般,*,*,形容詞,連体形-一般,オイシイ,美味しい,美味しい,オイシー,美味しい,オイシー,和,*,*,*,*,*,*,相,オイシイ,オイシイ,オイシイ,オイシイ,"0,3",C2,*,1201225110528705,4370
寿司	名詞,普通名詞,一般,*,*,*,スシ,寿司,寿司,スシ,寿司,スシ,和,ス濁,基本形,*,*,*,*,体,スシ,スシ,スシ,スシ,"1,2",C3,*,5269967956222464,19172
を	助詞,格助詞,*,*,*,*,ヲ,を,を,オ,を,オ,和,*,*,*,*,*,*,格助,ヲ,ヲ,ヲ,ヲ,*,"動詞%F2@0,名詞%F1,形容詞%F2@-1",*,11381878116459008,41407
食べ	動詞,一般,*,*,下一段-バ行,連用形-一般,タベル,食べる,食べ,タベ,食べる,タベル,和,*,*,*,*,*,*,用,タベ,タベル,タベ,タベル,2,C1,M4@1,6220495691326081,22630
た	助動詞,*,*,*,助動詞-タ,終止形-一般,タ,た,た,タ,た,タ,和,*,*,*,*,*,*,助動,タ,タ,タ,タ,*,"動詞%F2@1,形容詞%F4@-2",*,5948916285711019,21642
。	補助記号,句点,*,*,*,*,*,。,。,*,。,*,記号,*,*,*,*,*,*,補助,*,*,*,*,*,*,*,6880571302400,25
おいしく	形容詞,一般,*,*,形容詞,連用形-一般,オイシイ,美味しい,おいしく,オイシク,おいしい,オイシー,和,*,*,*,*,*,*,相,オイシク,オイシイ,オイシク,オイシイ,"0,3",C2,*,1201225076974209,4370
ない	形容詞,非自立可能,*,*,形容詞,連体形-一般,ナイ,無い,ない,ナイ,ない,ナイ,和,*,*,*,*,*,*,相,ナイ,ナイ,ナイ,ナイ,1,C3,*,7543208145986241,27442
すし	名詞,普通名詞,一般,*,*,*,スシ,寿司,すし,スシ,すし,スシ,和,ス濁,基本形,*,*,*,*,体,スシ,スシ,スシ,スシ,"1,2",C3,*,5269967855559168,19172
は	助詞,係助詞,*,*,*,*,ハ,は,は,ワ,は,ワ,和,*,*,*,*,*,*,係助,ハ,ハ,ハ,ハ,*,"動詞%F2@0,名詞%F1,形容詞%F2@-1",*,8059703733133824,29321
たべ	動詞,一般,*,*,下一段-バ行,未然形-一般,タベル,食べる,たべ,タベ,たべる,タベル,和,*,*,*,*,*,*,用,タベ,タベル,タベ,タベル,2,C1,M4@1,6220495657771585,22630
られ	助動詞,*,*,*,助動詞-レル,未然形-一般,ラレル,られる,られ,ラレ,られる,ラレル,和,*,*,*,*,*,*,助動,ラレ,ラレル,ラレ,ラレル,*,動詞%F3@2,M4@1,10936575907209793,39787
ない	助動詞,*,*,*,助動詞-ナイ,終止形-一般,ナイ,ない,ない,ナイ,ない,ナイ,和,*,*,*,*,*,*,助動,ナイ,ナイ,ナイ,ナイ,*,動詞%F3@0,*,7542108634358443,27438
EOS
#+end_example


This output is reduced to the following. The first column is the word as seen, the second the type, then the morph, and
finally the surface. Compare 美味しい and おいしい.

#+begin_src bash :results verbatim :exports both
echo "美味しい寿司を食べた。おいしくないすしはたべられない" | m-mecab.sh | csvcut -c 1,8,11
#+end_src

#+RESULTS:
#+begin_example
美味しい	形容詞,美味しい,美味しい
寿司	名詞,寿司,寿司
を	助詞,を,を
食べ	動詞,食べる,食べる
た	助動詞,た,た
。	補助記号,。,。
おいしく	形容詞,美味しい,おいしい
ない	形容詞,無い,ない
すし	名詞,寿司,すし
は	助詞,は,は
たべ	動詞,食べる,たべる
られ	助動詞,られる,られる
ない	助動詞,ない,ない
EOS,,
#+end_example


This text would be stored as follows in the database. Note that 寿司 and 美味しい are stored twice. One for each version (kanji and hiragana).


#+begin_src bash :results raw :exports results
echo "美味しい寿司を食べた。おいしくないすしはたべられない" | m-mecab.sh | csvcut -c 1,8,11 | csvcut -t -c 2 -u 3
#+end_src

| wtype  | root   | surface |
|--------+--------+---------|
| 助動詞  | た      | た       |
| 助動詞  | ない    | ない     |
| 助動詞  | られる  | られる   |
| 助詞    | は      | は       |
| 助詞    | を      | を       |
| 動詞    | 食べる  | たべる   |
| 動詞    | 食べる  | 食べる   |
| 名詞    | 寿司    | すし     |
| 名詞    | 寿司    | 寿司     |
| 形容詞  | 無い    | ない     |
| 形容詞  | 美味しい | おいしい  |
| 形容詞  | 美味しい | 美味しい  |

